// Паттерны назделения
export const splitAddressPatternn =
  /^(.*?\d+\-(?:[ыиоа]?[йя]|ти|лет).*?|.*?)(?:,?\s)((?:(?:д(?:ом)?|уч(?:ас)?(?:ток)|кор(?:п)?(?:ус)?|з(?:ем)?(?:ельный)?(?:\/у)?|вл?(?:ад)?(?:ен)?(?:ие)?|c(?:оор)?(?:ужение)?|стр(?:оен)?(?:ие)?|[№Nn]|$|)\.?(?:[,?\s]|(?=\d))).*?\d.*)?$/;
export const splitHouseAndFlatPattern =
  /^(.*?)(?:,?\s)((?:кв\.кв|кв(?:артир[аы])?|п(?:ом)?(?:ещ)?(?:ение)?)\.?(?:[,?\s]|(?=\d))(?:[№N]\s)?[\dIVX][\d\-\\\/а-яА-Я,\. IVX]*)$/;

// Паттерны замены (удаления)
// const municipalPartFullPattern =
//   /((?:Гг Москва)?(?:,\s)?.*?(?:(?:[мМ]уницип|[Гг]ор).*?(?:[оО]кр|[оО]браз)|(?:[Мм]униц|[Гг]ор).*?рай|(?:[Сс]ель|[Гг]ор).*?пос).*?(?:,\s))/;
export const moscowCityPattern = /^([Гг]?(?:ор)?(?:од)?\.?\s?[Мм]осква,?\s?)/i;
export const municipalPartPattern =
  /^(.*?(?:(?:[мМ]уницип|[Гг]ор).*?(?:[оО]кр|[оО]браз)|(?:[Мм]униц|[Гг]ор).*?рай|(?:[Сс]ель|[Гг]ор).*?пос).*?(?:,\s?))/;
export const streetNumberPaddingPattern = /(?<=\s)(0+)(?=\d\-)/i;
export const extraWhitespacePattern = /([,\.;]|\s+(?=\s))/g;

export const streetTypePattern =
  /(?<=\s|^)(ул(?:ица)?\.?|д(?:ер)?(?:евня)?\.?|пер(?:еулок)?\.?|п(?:р)?(?:оезд|\-д)?\.?(?! [№Nn])|г(?:ор)?(?:од)?\.?|(?:дачный |рабочий )?п(?:ос)?(?:[её]л)?(?:ок)?\.?|с(?:ело?)?\.?|ш(?:оссе)?\.?|посел(?:ен)?(?:ие)?\.?|пл(?:ощадь)?\.?|бул(?:ьв)?(?:ар)?\.?|наб(?:ережная)?\.?|туп(?:ик)?\.?|пр?(?:осп)?(?:ект)?(?:-т)?\.?|аллея|хутор|линия|просек)(?=\s|$)/gi;

export const numericPartPattern = /([\dIVX][\d\-\\\/а-яА-ЯIVX]*)/g;

export const streetTypeReplacements = [
  {
    pattern: /(?<=\s|^)((?:ул(?:ица)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'улица',
  },
  {
    pattern: /(?<=\s|^)((?:д(?:ер)?(?:евня)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'деревня',
  },
  {
    pattern: /(?<=\s|^)((?:пер(?:еул)(?:ок)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'переулок',
  },
  {
    pattern: /(?<=\s|^)((?:п(?:р)?(?:оезд|\-д)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'проезд',
  },
  {
    pattern: /(?<=\s|^)((?:пр?(?:осп)?(?:ект)?(?:-т)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'проспект',
  },
  {
    pattern: /(?<=\s|^)((?:г(?:ор)?(?:од)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'город',
  },
  {
    pattern:
      /(?<=\s|^)((?:дачный\sп(?:ос)?(?:[её]л)?(?:ок)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'дачный поселок',
  },
  {
    pattern:
      /(?<=\s|^)((?:рабочий\sп(?:ос)?(?:[её]л)?(?:ок)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'рабочий поселок',
  },
  {
    pattern: /(?<=\s|^)((?:п(?:ос)?(?:[её]л)?(?:ок)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'поселок',
  },
  {
    pattern: /(?<=\s|^)((?:посел(?:ен)?(?:ие)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'поселение',
  },
  {
    pattern: /(?<=\s|^)((?:с(?:ело?)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'село',
  },
  {
    pattern: /(?<=\s|^)((?:ш(?:оссе)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'шоссе',
  },
  {
    pattern: /(?<=\s|^)((?:пл(?:ощадь)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'площадь',
  },
  {
    pattern: /(?<=\s|^)((?:бул(?:ьв)?(?:ар)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'бульвар',
  },
  {
    pattern: /(?<=\s|^)((?:наб(?:ережная)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'набережная',
  },
  {
    pattern: /(?<=\s|^)((?:туп(?:ик)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'тупик',
  },
  {
    pattern: /(?<=\s|^)((?:ал(?:лея)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'аллея',
  },
  {
    pattern: /(?<=\s|^)((?:хут(?:ор)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'хутор',
  },
  {
    pattern: /(?<=\s|^)((?:л(?:ин)?(?:ия)?)(?:\.?[,\s]\s?|$))/i,
    replacement: 'линия',
  },
  {
    pattern: /(?<=\s|^)((?:просек)(?:\.?[,\s]\s?|$))/i,
    replacement: 'просек',
  },
];

export const houseTypeReplacements = [
  {
    pattern: /((?<=^)(?:|\s)(?=\d)|(?:(?<=\s|^)(?:д(?:ом)?)\.?\s?))/i,
    replacement: 'дом',
  },
  {
    pattern: /(?<=[\s\d]|^)((?:к(?:ор)?п?(?:ус)?)(?:\.?\s?|$))/i,
    replacement: 'корпус',
  },
  {
    pattern: /(?<=[\s\d]|^)((?:с(?:тр)?(?:оен)?(?:ие)?)(?:\.?\s?|$))/i,
    replacement: 'строение',
  },
  {
    pattern: /(?<=[\s\d]|^)((?:вл?(?:ад)?(?:ен)?(?:ие)?(?:-е)?)(?:\.?\s?|$))/i,
    replacement: 'владение',
  },
  {
    pattern: /(?<=[\s\d]|^)((?:уч(?:аст)?(?:ок)?|з\/\\у)(?:\.?\s?|$))/i,
    replacement: 'участок',
  },
];
